package utils;
public abstract class CreditsUpwards {

    public static void credits() {
        String thankYouText =
                "Спасибо за внимание!\n" +
                "Мы благодарим всех за поддержку и помощь.\n" +
                "Это стало возможно благодаря вам!\n" +
                "Особая благодарность нашему преподавателю Сергею Бугаенко\n" +
                "Надеемся, вам понравился этот проект!\n\n" +
                "КОМАНДА РАЗРАБОТЧИКОВ:\n" +
                "Александр Оборский\n" +
                "Константин Теймуров\n" +
                "Ева Дитерле\n" +
                "Елена Таранова\n";


        for (int i = 0; i < 3; i++) System.out.println();
        System.out.println(thankYouText);
        for (int i = 0; i < 5; i++) System.out.println();
        delay(5000);

        for (int i = 0; i < 2; i++) { System.out.println(); delay(500); }


        String javaLogo =
        "       ░▒▓█▓▒░ ░▒▓██████▓▒░ ░▒▓█▓▒░░▒▓█▓▒░ ░▒▓██████▓▒░  \n"+
        "       ░▒▓█▓▒░░▒▓█▓▒░░▒▓█▓▒░░▒▓█▓▒░░▒▓█▓▒░░▒▓█▓▒░░▒▓█▓▒░ \n"+
        "       ░▒▓█▓▒░░▒▓█▓▒░░▒▓█▓▒░ ░▒▓█▓▒▒▓█▓▒░ ░▒▓█▓▒░░▒▓█▓▒░ \n"+
        "       ░▒▓█▓▒░░▒▓████████▓▒░ ░▒▓█▓▒▒▓█▓▒░ ░▒▓████████▓▒░ \n"+
        "░▒▓█▓▒░░▒▓█▓▒░░▒▓█▓▒░░▒▓█▓▒░  ░▒▓█▓▓█▓▒░  ░▒▓█▓▒░░▒▓█▓▒░ \n"+
        "░▒▓█▓▒░░▒▓█▓▒░░▒▓█▓▒░░▒▓█▓▒░  ░▒▓█▓▓█▓▒░  ░▒▓█▓▒░░▒▓█▓▒░ \n"+
        " ░▒▓██████▓▒░ ░▒▓█▓▒░░▒▓█▓▒░   ░▒▓██▓▒░   ░▒▓█▓▒░░▒▓█▓▒░ \n"+
        "                                                         \n"+
        "                                                         \n";


        String[] java = {
                "          _____                    _____                _____                    _____          ",
                "         /\\    \\                  /\\    \\              /\\    \\                  /\\    \\         ",
                "        /::\\    \\                /::\\    \\            /::\\____\\                /::\\    \\        ",
                "        \\:::\\    \\              /::::\\    \\          /:::/    /               /::::\\    \\       ",
                "         \\:::\\    \\            /::::::\\    \\        /:::/    /               /::::::\\    \\      ",
                "          \\:::\\    \\          /:::/\\:::\\    \\      /:::/    /               /:::/\\:::\\    \\     ",
                "           \\:::\\    \\        /:::/__\\:::\\    \\    /:::/____/               /:::/__\\:::\\    \\    ",
                "           /::::\\    \\      /::::\\   \\:::\\    \\   |::|    |               /::::\\   \\:::\\    \\   ",
                "  _____   /::::::\\    \\    /::::::\\   \\:::\\    \\  |::|    |     _____    /::::::\\   \\:::\\    \\  ",
        " /\\    \\ /:::/\\:::\\    \\  /:::/\\:::\\   \\:::\\    \\ |::|    |    /\\    \\  /:::/\\:::\\   \\:::\\    \\ ",
                "/::\\    /:::/  \\:::\\____\\/:::/  \\:::\\   \\:::\\____\\|::|    |   /::\\____\\/:::/  \\:::\\   \\:::\\____",
                "\\:::\\  /:::/    \\::/    /\\::/    \\:::\\  /:::/    /|::|    |  /:::/    /\\::/    \\:::\\  /:::/    /",
                " \\:::\\/:::/    / \\/____/  \\/____/ \\:::\\/:::/    / |::|    | /:::/    /  \\/____/ \\:::\\/:::/    / ",
                "  \\::::::/    /                    \\::::::/    /  |::|____|/:::/    /            \\::::::/    /  ",
                "   \\::::/    /                      \\::::/    /   |:::::::::::/    /              \\::::/    /   ",
                "    \\::/    /                       /:::/    /    \\::::::::::/____/               /:::/    /    ",
                "     \\/____/                       /:::/    /      ~~~~~~~~~~                    /:::/    /     ",
                "                                  /:::/    /                                    /:::/    /      ",
                "                                 /:::/    /                                    /:::/    /       ",
                "                                 \\::/    /                                     \\::/    /        ",
                "                                  \\/____/                                       \\/____/         ",
        };

        for (int i = 0; i < java.length; i++) {
            System.out.println(java[i]);
            delay(500);
        }


    }

    public static void delay(int delay) {
        if (delay < 0) delay = 1000;
        try {
            Thread.sleep(delay);
        } catch (InterruptedException e) {
            Thread.currentThread().interrupt();
        }
    }

//    public static void main(String[] args) {
//        credits();
//    }

}

